Функция ПолучитьТекущиеДанныеПосещаемости(ТекущееВремя, Зона="Периметр") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПосещаемости();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущееВремя);
	Запрос.УстановитьПараметр("ВсеЗоны", НЕ ЗначениеЗаполнено(Зона));
	Запрос.УстановитьПараметр("Зона", Зона);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
	
КонецФункции

Функция ТекстЗапросаПосещаемости()
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	ВложенныйЗапрос.НазваниеЗоны КАК НазваниеЗоны,
		|	СУММА(ВложенныйЗапрос.Вошло - ВложенныйЗапрос.Вышло) КАК Всего,
		|	СУММА(ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ВремяПоказаний, &ТекущаяДата, ЧАС) <= 1
		|				ТОГДА ВложенныйЗапрос.Вошло - ВложенныйЗапрос.Вышло
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДинамикаЧас,
		|	СУММА(ВЫБОР
		|			КОГДА РАЗНОСТЬДАТ(ВложенныйЗапрос.ВремяПоказаний, &ТекущаяДата, МИНУТА) <= 15
		|				ТОГДА ВложенныйЗапрос.Вошло - ВложенныйЗапрос.Вышло
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Динамика15Мин
		|ИЗ
		|	(ВЫБРАТЬ
		|		Зоны.NameZone КАК НазваниеЗоны,
		|		ВЫБОР
		|			КОГДА Переходы.ID_Vector = 1
		|				ТОГДА Общ.SumIn
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Переходы.ID_Vector = 2
		|						ТОГДА Общ.SumOut
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ КАК Вошло,
		|		ВЫБОР
		|			КОГДА Переходы.ID_Vector = 1
		|				ТОГДА Общ.SumOut
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Переходы.ID_Vector = 2
		|						ТОГДА Общ.SumIn
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ КАК Вышло,
		|		Общ.TimeRecord КАК ВремяПоказаний
		|	ИЗ
		|		ВнешнийИсточникДанных.ОМ_СчетчикиПосещаемости.Таблица.dbo_CM_StorageEnter КАК Общ
		|			ПОЛНОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.ОМ_СчетчикиПосещаемости.Таблица.dbo_CM_CrossZoneEnter КАК Переходы
		|				ПОЛНОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.ОМ_СчетчикиПосещаемости.Таблица.dbo_CM_Zone КАК Зоны
		|				ПО Переходы.ID_Zone = Зоны.ID_Zone
		|			ПО Общ.ID_Enter = Переходы.ID_Enter
		|			ПОЛНОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.ОМ_СчетчикиПосещаемости.Таблица.dbo_CM_Enter КАК Входы
		|			ПО Общ.ID_Enter = Входы.ID_Enter
		|	ГДЕ
		|		ЧАС(Общ.TimeRecord) >= 10
		|		И ЧАС(Общ.TimeRecord) < 20
		|		И НАЧАЛОПЕРИОДА(Общ.TimeRecord, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) 
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Зоны.NameZone,
		|		ВЫБОР
		|			КОГДА Переходы.ID_Vector = 1
		|				ТОГДА Общ.SumIn
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Переходы.ID_Vector = 2
		|						ТОГДА Общ.SumOut
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА Переходы.ID_Vector = 1
		|				ТОГДА Общ.SumOut
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Переходы.ID_Vector = 2
		|						ТОГДА Общ.SumIn
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОНЕЦ,
		|		Общ.TimeRecord) КАК ВложенныйЗапрос
		|ГДЕ &ВсеЗоны ИЛИ ВложенныйЗапрос.НазваниеЗоны = &Зона
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НазваниеЗоны";
	
	Возврат ТекстЗапроса
	
КонецФункции
