
Функция HTMLТекущиеДанныеПосещаемости() Экспорт
	ТекущееВремя = НачалоМинуты(ТекущаяДата());
	ДанныеПосещаемости = ТекущиеДанныеПосещаемости(ТекущееВремя);
	Если ДанныеПосещаемости.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущееВремя", ТекущееВремя);
		ДополнительныеПараметры.Вставить("Лимит", 40000);
		ВсегоПроцент = ?(ЗначениеЗаполнено(ДанныеПосещаемости[0].Всего), ДанныеПосещаемости[0].Всего/ДополнительныеПараметры.Лимит * 100, 0);
		ДополнительныеПараметры.Вставить("ВсегоПроцент", Строка(ВсегоПроцент) + "%");
		ТекстHTML = ЗаполнитьШаблонHTML(ДанныеПосещаемости[0], ДополнительныеПараметры)
	Иначе
		ТекстHTML = "Ошибка в данных";
	КонецЕсли;
	Возврат ТекстHTML
	
КонецФункции





Функция ТекущиеДанныеПосещаемости(ТекущееВремя) Экспорт
	
	ИмяТаблицСчетчиков = "ОМ_СчетчикиПосещаемости";
	ПП_Общий.ИнициализироватьВнешниеДанные(ИмяТаблицСчетчиков);
	
	ДанныеПосещаемости = Портал_СчетчикиПосещаемостиПовтИсп.ПолучитьТекущиеДанныеПосещаемости(ТекущееВремя, "Периметр");
	
	Возврат ДанныеПосещаемости
	
КонецФункции


Функция ЗаполнитьШаблонHTML(ДанныеЗаполнения, ДополнительныеПараметры)
	
	ТекстHTML = ПолучитьОбщийМакет("Портал_ТекущаяПосещаемость").ПолучитьТекст();
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Всего}", ДанныеЗаполнения.Всего);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Лимит}", ДополнительныеПараметры.Лимит);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ВсегоПроцент}", ДополнительныеПараметры.ВсегоПроцент);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ДинамикаЧас}", ДанныеЗаполнения.ДинамикаЧас);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{Динамика15Мин}", ДанныеЗаполнения.Динамика15Мин);
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ДатаВремя}", Формат(ДополнительныеПараметры.ТекущееВремя, "Л=ru_RU; ДФ='dd.MM.yyyy HH:mm'"));
	
	Возврат ТекстHTML
	
КонецФункции